*** Esecuzione di più esempi

    Prima di tutto vediamo come eseguire la funzione =sum_pos= più
    volte con dati diversi.  La funzione richiede come argomento una
    lista (o simile) di interi, e quindi per fare più "giri" ci serve
    una lista di liste.
#+NAME: sum-pos-multi-test-0
#+BEGIN_SRC python :session py :results output :exports both
data = (
    (1,2,3),
    (0, -5, 7),
    (3 -4, 0, 2),
    )
for ii in data:
    t = sum_pos(ii)
    print(ii, "->", t)
#+END_SRC

#+RESULTS: sum-pos-multi-test-0
: (1, 2, 3) -> 6
: (0, -5, 7) -> 7
: (-1, 0, 2) -> 2

** Codice "da file"

   Vediamo adesso anche un esempio in cui scriviamo del codice in un
   file e poi lo eseguiamo.

   1. usiamo il file =main.py= già creato da =repl=,

   2. inseriamo una funzione =sum_pos= che dato un "insieme di numeri"
      *calcola e restituisce* la somma dei soli positivi.
 #+BEGIN_SRC python :session py :results silent
def sum_pos(ints):
    "The sum of the elements in INTS"
    t = 0              # creo un "accumulatore" nullo
    for i in ints:     # ciclo su tutti gli elementi di INTS
        if i > 0:      # e solamente se quello corrente è positivo
            t += i     # lo sommo all'accumulatore
    return t           # restituisco il risultato
 #+END_SRC

   3. per fare un primo controllo proviamo ad usare la funzione in un
      paio di esempi,

 #+NAME: sum-pos-test-0
 #+BEGIN_SRC python :session py :results output :exports both
ii = (2,3,4,0-12)
t = sum_pos(ii)
print(ii, "->", t)
 #+END_SRC

 #+RESULTS: sum-pos-test-0
 : (2, 3, 4, -12) -> 9

*** Estrazione dei dati

    Con la =insert= abbiamo *scritto* dei nel database, adesso vediamo
    come, usando l'istruzione =select=, si possono *leggere*.

    *Nota*: come sinonimo di "leggere" si usa spesso il termine
    "estrarre" che però può generare confusione perché da l'idea che i
    dati vengono "tolti" dal database, cosa che non avviene.

    Per vedere il contenuto di una tabella si usa spesso questa
    espressione, che in pratica chiede di vedere il contenuto di tutte
    le colonne (l'asterisco) e di tutte le righe (perché questo è il
    comportamento normale in assenza di *filtri*).

#+name: select-asterisk
#+header: :dir ./
#+header: :db exa.db
#+begin_src sqlite :results output :exports both
select * from Person;
#+end_src

    E questo è un tipico risultato (il separatore di colonne dipende da
    molti fattori, ma la virgola è abbastanza normale).
#+RESULTS: select-asterisk
: 1,Linus,123-L,51
: 2,Richard,444-R,67
: 3,Bob,666-B,63

    In realtà, la "select con asterisco" è da evitare per vari motivi,
    primo tra tutti il fatto che si può sapere in anticipo quante
    saranno le colonne e quali "nomi" avranno.  Ricordarsi che le
    tabelle di una tabella possono cambiare nel tempo!  È quindi molto
    più corretto esplicitare sempre la lista delle colonne.

    *Nota*: per i "nomi" che seguono la /keyword/ =select= si usa spesso il
    termine di "colonna", ma il termine corretto è *descrittore di
    colonna*, per motivi che chiarirò tra poco.
#+name: select-with-names
#+header: :dir ./
#+header: :db exa.db
#+begin_src sqlite :results output :exports both
select code, name from Person;
#+end_src

#+RESULTS: select-with-names
: 123-L,Linus
: 444-R,Richard
: 666-B,Bob

*** Selezione di righe (WHERE)

    Abbiamo visto che in una =select= si possono "selezionare alcune
    colonne", se invece vogliamo selezionare delle righe, limitando
    così l'insieme delle righe su cui operiamo, dobbiamo usare la
    *clausola* =where=.

#+name: select-where-0
#+header: :dir ./
#+header: :db exa.db
#+begin_src sqlite :results output :exports both
select name, code
from Person
where age > 60;
#+end_src

#+RESULTS: select-where-0
: Richard,444-R
: Bob,666-B

    che come si vede "produce" solo due righe, quelle in cui la
    colonna =age= contiene un valore maggiore di 60.  La clausola =where=
    deve essere sempre seguita, come nell'esempio, da una *espressione
    logica* e seleziona solo le righe per cui l'espressione, il cui
    valore tipicamente dipende dal contenuto delle righe, è "vero".

    *Nota*: la clausola =where= non è legata alle =select= ma, come vedremo,
    può essere utilizzata anche in altre operazioni come
    l'aggiornamento o la cancellazione di dati e anche per "collegare"
    più tabelle.

    L'uso della =where= è semplice e direi intuitivo; nella pratica poi
    le difficoltà nascono dalla complessità dell'espressione logica
    che spesso coinvolge multipli operatori su multiple colonne.

    Un esempio appena più complicato:
#+name: select-where-1
#+header: :dir ./
#+header: :db exa.db
#+begin_src sqlite :results output :exports both
.header on
.separator |
.mode column
select name, code, age
from Person
where age > 60 and name = 'Bob';
#+end_src

    che genera una sola riga perché ho aggiunto, con l'operatore =and=
    una seconda condizione che ha reso la condizione complessiva più
    "stringente".

#+RESULTS: select-where-1
: name        code        age
: ----------  ----------  ----------
: Bob         666-B       63

    *Nota*: è in generale buona norma, sopratutto quando il risultato è
    pensato per essere "letto" includere nella lista delle colonne
    della =select= anche le colonne utilizzate nei vari "filtri",
    altrimenti si fa fatica a capire perché alcune righe sono presenti
    e altre no!.

**** Tabella singola

     Se uso una tabella singola, avrò una riga per ciascun numero di
     telefono; ciascun numero di telefono comparirà in una sola riga
     (non avrò numeri "ripetuti") da cui il vincolo =unique=, mentre
     invece potrò avere più righe con lo stesso nome.  Sia il nome che
     il numero dovranno essere presenti in tutte le righe, ossia non
     potrò avere righe in cui il dato è assente (=NULL=) da cui il
     vincolo =not null=.

     *Nota*: i *vincoli* definiti nel database (su singole o più tabelle,
     per singole colonne o per gruppi di colonne), vengono
     "controllati", "fatti rispettare" (/enforced!/) dal database ogni
     volta che si modifica il dato, quindi sia quando si aggiungono
     righe sia quando si modificano.

     *Nota*: in generale è importante scegliere nomi significativi (e
     essere coerenti nel loro uso).  Per le tabelle dei database il
     criterio per la scelta dei nomi è molto personale.  Una
     possibilità è pensare alla tabella come contenitore ed usare il
     termine usato "comunemente"; in questo caso il contenitore è
     l'*agenda*. Una alternativa è invece pensare alle righe, in questo
     caso "numeri di telefono" (abbreviato magari =tel_num= o =TelNum=),
     usando quindi il *plurale*.  Poi però, nel codice SQL (come nelle
     =where= degli esempi che vedremo nel seguito), quel nome viene
     usato per indicare il valore di quella colonna in *una riga*, e
     quindi sarebbe più naturale usare il *singolare*.

#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results silent
drop table if exists Agenda;
create table Agenda (
    name varchar[25] not null,
    phone varchar[20] not null unique
);
#+end_src

    L'inserimento dei dati non ha niente di particolare, specifico i
    nomi delle colonne e non indico il valore per la chiave primaria.

#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results silent
insert into Agenda (name, phone)
values
('Linus'   , '123-44-55-666'),
('Linus'   , '123-44-00-888'),
('Richard' , '300-00-11-22'),
('Richard' , '300-00-33-00'),
('Bob'     , '400-99-55-777');
#+end_src

    Un controllo giusto per vedere che l'inserimento sia andato a buon
    fine.

#+name: agenda-0
#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results output :exports both
select name, phone from Agenda;
#+end_src

#+RESULTS: agenda-0
: Linus,123-44-55-666
: Linus,123-44-00-888
: Richard,300-00-11-22
: Richard,300-00-33-00
: Bob,400-99-55-777

    Gestire il dati in questo mode, dal punto di vista delle teoria
    dei database relazionali, non è corretto, quantomeno perché ci
    sono dei dati duplicati (i nomi).  Ci sono varie ragioni per cui
    questo è un problema, ma al momento non ci interessano.  Ci
    interessa però la "soluzione standard": dividere i dati in due
    tabelle, una per i nomi e una per i numeri.

**** Collegamento (via where)

     Fatto l'inserimento, adesso vorremmo però poter "ricostruire" la
     tabella "completa", com'era originariamente in =Agenda=.  Per fare
     ciò dobbiamo estrarre le due colonne dalle due tabelle *collegando*
     (facendo una =join= tra) le righe.  Questo si può fare in due modi:
     usando una =where= o usando una =join= (nel senso di costrutto SQL).
     I dettagli li vedremo a lezione, qui mi basta poter scrivere un
     esempio utile per fare pratica con =repl.it=.

     *Nota*: i nomi delle colonne sono univoci all'*interno di una
     tabella* per cui, quando si usa una sola tabella, non c'è
     possibilità di equivoco.  Ma quando si hanno più tabelle, si
     potrebbero avere, in tabelle diverse, più colonne con lo stesso
     nome.  Qui "per fortuna" il problema non esiste, per cui nella
     =select= possiamo usare i nomi "direttamente".  La colonna =id= è
     però presente in entrambe le colonne, per cui dobbiamo usare la
     notazione più "completa" formata dal nome della tabella più il
     nome della colonna (come in =Person.id=).

#+name: phone-join-where
#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results output :exports both
.header on
.separator |
.mode column
select name, number                 -- nomi della colonne (per "fortuna" univoci)
from Person, Phone                  -- tabelle da cui prendere i dati
where Person.id = Phone.id_person;  -- condizione di collegamento tra righe
#+end_src

#+RESULTS: phone-join-where
: name        number
: ----------  -------------
: Linus       123-44-55-666
: Linus       123-44-00-888
: Richard     300-00-11-22
: Richard     300-00-33-00
: Bob         Bob,400-99-55

**** Collegamento (via join)

     Come già detto, il collegamento tra tabelle si può fare anche con
     un'altra sintassi, per molti versi preferibile, quantomeno
     perché così si utilizza la =where=  per il suo scopo "vero", ossia
     limitare il numero di righe interessate dall'operazione che si
     sta effettuando (=select= o altro).

#+name: phone-join-join
#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results output :exports both
.header on
.separator |
.mode column
select name, number
from Person left join Phone
on Person.id = Phone.id_person;
#+end_src

#+RESULTS: phone-join-join
: name        number
: ----------  -------------
: Linus       123-44-00-888
: Linus       123-44-55-666
: Richard     300-00-11-22
: Richard     300-00-33-00
: Bob         Bob,400-99-55

**** Collegamento (full join)                                      :noexport:

#+name: phone-full-join
#+header: :dir ./
#+header: :db phone.db
#+begin_src sqlite :results output :exports both
select name, number
from Person, Phone;
#+end_src

#+RESULTS: phone-full-join
#+begin_example
Linus,123-44-00-888
Linus,123-44-55-666
Linus,300-00-11-22
Linus,300-00-33-00
Linus,"Bob,400-99-55-777"
Richard,123-44-00-888
Richard,123-44-55-666
Richard,300-00-11-22
Richard,300-00-33-00
Richard,"Bob,400-99-55-777"
Bob,123-44-00-888
Bob,123-44-55-666
Bob,300-00-11-22
Bob,300-00-33-00
Bob,"Bob,400-99-55-777"
#+end_example

